ext_b24/DataProcessors/алсавб24_api_CRM_СмартПроцесс_Партнеры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>алсавб24_api_CRM_СмартПроцесс_Партнеры</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

ext_b24/InformationRegisters/алсавб24_СопоставлениеОбъектовБ24.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>алсавб24_СопоставлениеОбъектовБ24</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Объект1С</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>TITLE</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип1С</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ENTITY_ID</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ENTITY_TYPE_ID</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ext_b24/DataProcessors/алсавб24_api_CRM_СмартПроцесс_Партнеры/Ext/ManagerModule.bsl
///************
// Работа с API 
// https://apidocs.bitrix24.ru/api-reference/crm/universal/crm-item-add.html
// https://apidocs.bitrix24.ru/api-reference/crm/universal/crm-item-update.html
// "entityTypeId": 1050,"title": "Партнеры", 
//
//curl --location 'https://alsav.bitrix24.ru/rest/175/111j1gle9m8oignr/crm.type.get' \
//--header 'Content-Type: application/json' \
//--header 'Cookie: qmb=0.' \
//--data '{
//    "id": 1050
//}'
//
// 
///************

// Создать Смарт-процесс "Партнер"
//
// Параметры:
//  Параметры - Структура - параметры для создания партнера:
//    * Наименование - Строка - наименование партнера (обязательно)
//    * Описание - Строка - описание партнера (необязательно)
//    * Ответственный - Число - ID ответственного пользователя (необязательно)
//
// Возвращаемое значение:
//  Структура - результат создания, содержит ID созданного партнера
Функция СоздатьПартнера(Знач Параметры) Экспорт
	
	// Формируем тело запроса для создания смарт-процесса
	ТелоЗапроса = Новый Структура;
	ТелоЗапроса.Вставить("entityTypeId", Обработки.алсавб24_api_CRM_Common.ENTITY_TYPE_ID_Партнеры());
	
	Поля = Новый Структура;
	
	// Обязательные поля
	Если Параметры.Свойство("Наименование") И ПустаяСтрока(Параметры.Наименование) = Ложь Тогда
		Поля.Вставить("title", Параметры.Наименование);
	Иначе
		ВызватьИсключение "Не указано наименование партнера";
	КонецЕсли;
	
	// Опциональные поля
	Если Параметры.Свойство("Описание") И ПустаяСтрока(Параметры.Описание) = Ложь Тогда
		Поля.Вставить("description", Параметры.Описание);
	КонецЕсли;
	
	Если Параметры.Свойство("Ответственный") И Параметры.Ответственный <> Неопределено Тогда
		Поля.Вставить("assignedById", Параметры.Ответственный);
	КонецЕсли;
	
	ТелоЗапроса.Вставить("fields", Поля);
	
	// Преобразуем в JSON
	JSONСтрока = алсавб24_Json.СтруктураВjson(ТелоЗапроса);
	
	// Отправляем запрос
	РезультатОтвета = алсавб24_Http.ОтправитьPOSTЗапрос("crm.item.add", JSONСтрока);
	
	// Парсим ответ
	Результат = алсавб24_Json.JSONВЗначение(РезультатОтвета);
	
	// Проверяем результат
	Если Результат.Свойство("error") Тогда
		ВызватьИсключение "Ошибка при создании партнера: " + Результат.error_description;
	КонецЕсли;
	
	Возврат Результат.result;
	
КонецФункции

// Обновить Смарт-Процесс "Партнер"
//
// Параметры:
//  ID - Число - ID партнера в Б24
//  Параметры - Структура - параметры для обновления партнера:
//    * Наименование - Строка - наименование партнера (необязательно)
//    * Описание - Строка - описание партнера (необязательно)
//    * Ответственный - Число - ID ответственного пользователя (необязательно)
//
// Возвращаемое значение:
//  Структура - результат обновления
Функция ОбновитьПартнера(Знач ID, Знач Параметры) Экспорт
	
	// Формируем тело запроса для обновления смарт-процесса
	ТелоЗапроса = Новый Структура;
	ТелоЗапроса.Вставить("entityTypeId", Обработки.алсавб24_api_CRM_Common.ENTITY_TYPE_ID_Партнеры());
	ТелоЗапроса.Вставить("id", ID);
	
	Поля = Новый Структура;
	
	// Опциональные поля
	Если Параметры.Свойство("Наименование") И ПустаяСтрока(Параметры.Наименование) = Ложь Тогда
		Поля.Вставить("title", Параметры.Наименование);
	КонецЕсли;
	
	Если Параметры.Свойство("Описание") И ПустаяСтрока(Параметры.Описание) = Ложь Тогда
		Поля.Вставить("description", Параметры.Описание);
	КонецЕсли;
	
	Если Параметры.Свойство("Ответственный") И Параметры.Ответственный <> Неопределено Тогда
		Поля.Вставить("assignedById", Параметры.Ответственный);
	КонецЕсли;
	
	ТелоЗапроса.Вставить("fields", Поля);
	
	// Преобразуем в JSON
	JSONСтрока = алсавб24_Json.СтруктураВjson(ТелоЗапроса);
	
	// Отправляем запрос
	РезультатОтвета = алсавб24_Http.ОтправитьPOSTЗапрос("crm.item.update", JSONСтрока);
	
	// Парсим ответ
	Результат = алсавб24_Json.JSONВЗначение(РезультатОтвета);
	
	// Проверяем результат
	Если Результат.Свойство("error") Тогда
		ВызватьИсключение "Ошибка при обновлении партнера: " + Результат.error_description;
	КонецЕсли;
	
	Возврат Результат.result;
	
КонецФункции

// Получить идентификатор смарт-процесса "Партнеры" из регистра сведений
//
// Параметры:
//  Партнер - СправочникСсылка.Партнеры - ссылка на партнера
//
// Возвращаемое значение:
//  Число - идентификатор партнера в Б24 или 0, если не найден
Функция ПолучитьИдентификаторПартнераБ24(Знач Партнер) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	алсавб24_СопоставлениеОбъектовБ24.ENTITY_ID КАК ID
		|ИЗ
		|	РегистрСведений.алсавб24_СопоставлениеОбъектовБ24 КАК алсавб24_СопоставлениеОбъектовБ24
		|ГДЕ
		|	алсавб24_СопоставлениеОбъектовБ24.Объект1С = &Партнер
		|	И алсавб24_СопоставлениеОбъектовБ24.ENTITY_TYPE_ID = &ENTITY_TYPE_ID";

	Запрос.УстановитьПараметр("Партнер", Партнер);
	Запрос.УстановитьПараметр("ENTITY_TYPE_ID", Обработки.алсавб24_api_CRM_Common.ENTITY_TYPE_ID_Партнеры());

	РезультатЗапроса = Запрос.Выполнить();

	Если РезультатЗапроса.Пустой() Тогда
		Возврат 0;
	КонецЕсли;

	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();

	Возврат Выборка.ID;

КонецФункции
